package exam01;


public class Sample04 {

	public static void main(String[] args) {
		/*
		 * Scanner 를 사용하여 사용자 입력을 받고 다음의 결과가 나오도록 하시오.
		 *    1. 사용자 입력을 통해 국어, 영어, 수학 점수를 입력 받는다. (정수 데이터를 입력 받는다.)
		 *    2. 입력 받은 정수 데이터의 값에 대해 총점과 평균을 구한다.
		 *    3. 평균 점수가 60점 이상인 경우에만 다음의 메시지를 출력한다.
		 *        축하합니다. 합격입니다.
		 *         총점 : 213점
		 *         국어 : 75점
		 *         영어 : 70점
		 *         수학 : 68점
		 *         평균 : 71.0점
		 *    4. 평균 점수가 60점 미만인 경우에는 다음의 메시지를 출력한다.
		 *         평균 점수가 미달하였습니다.
		 *    5. 국어,영어 ,수학 과목중에 40점 미만의 경우 다음의 메시지를 출력한다.
		 *    과락된 과목이 있어 불합격 되었습니다.     
		 *    
		 *    
		 *    
		 *   환율 계산 프로그램
		 *   원달러 환율 값 입력 : 1235.00
		 *   
		 *   달러를 원화로 계산하겠습니까? 아니면 원화를 달러로 계산하겠습니까?
		 *   (1: 달러 -> 원화,2:원화->달러)
		 *   
		 *   달러값 입력 : 100
		 *   100달러는 123500원 입니다.
		 *   
		 *   원화값 입력 : 100000
		 *   100000 원은 약 80.97 달러 입니다.
		 *    
		 *    
		 *    
		 */

		
	
	}
}
		

